import type {Chat} from "../pages/chats/type";


export const chatsMock: Chat[] = [
  {
    id: '1',
    title: 'Андрей',
    message: 'Изображение',
    time: '10:49',
    unread: 2,
    active: false,
    messages: [],
  },
  {
    id: '2',
    title: 'Киноклуб',
    message: 'Вы: стикер',
    time: '12:00',
    active: false,
    messages: [],
  },
  {
    id: '3',
    title: 'Илья',
    message: 'Друзья, у меня для вас особенный выпуск новостей...',
    time: '15:12',
    unread: 4,
    active: false,
    messages: [],
  },
  {
    id: '4',
    title: 'Вадим',
    message: 'Круто!',
    time: 'Пт',
    active: false,
    messages: [
      {
        id: '1',
        content:
          'Привет! Смотри, тут всплыл интересный кусок лунной московской истории — NASA в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну.',
        time: '11:56',
        isMine: false,
      },
      {
        id: '2',
        content:
          'Сейчас мы все знаем, что астронавты летали с моделью 500 EL — и к слову говоря, все туши этих камер уже на заводе по поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой.',
        time: '11:57',
        isMine: false,
      },
      {
        id: '3',
        content:
          'Хассельблад, много адаптируя SWC для космоса, но что-то пошло не так в расчетах или инженерии и не пошло. Всего их было произведено 25 штук, одну из них недавно продали за 450000 евро.',
        time: '11:58',
        isMine: false,
      },
      {
        id: '3',
        content:
          'Хассельблад, много адаптируя SWC для космоса, но что-то пошло не так в расчетах или инженерии и не пошло. Всего их было произведено 25 штук, одну из них недавно продали за 450000 евро.',
        time: '11:58',
        isMine: false,
      },
      {
        id: '3',
        content:
          'Хассельблад, много адаптируя SWC для космоса, но что-то пошло не так в расчетах или инженерии и не пошло. Всего их было произведено 25 штук, одну из них недавно продали за 450000 евро.',
        time: '11:58',
        isMine: false,
      },
      {
        id: '3',
        content:
          'Хассельблад, много адаптируя SWC для космоса, но что-то пошло не так в расчетах или инженерии и не пошло. Всего их было произведено 25 штук, одну из них недавно продали за 450000 евро.',
        time: '11:58',
        isMine: false,
      },
      {
        id: '3',
        content:
          'Хассельблад, много адаптируя SWC для космоса, но что-то пошло не так в расчетах или инженерии и не пошло. Всего их было произведено 25 штук, одну из них недавно продали за 450000 евро.',
        time: '11:58',
        isMine: false,
      },
      {
        id: '3',
        content:
          'Хассельблад, много адаптируя SWC для космоса, но что-то пошло не так в расчетах или инженерии и не пошло. Всего их было произведено 25 штук, одну из них недавно продали за 450000 евро.',
        time: '11:58',
        isMine: false,
      },
      {
        id: '3',
        content:
          'Хассельблад, много адаптируя SWC для космоса, но что-то пошло не так в расчетах или инженерии и не пошло. Всего их было произведено 25 штук, одну из них недавно продали за 450000 евро.',
        time: '11:58',
        isMine: false,
      },
      {
        id: '3',
        content:
          'Хассельблад, много адаптируя SWC для космоса, но что-то пошло не так в расчетах или инженерии и не пошло. Всего их было произведено 25 штук, одну из них недавно продали за 450000 евро.',
        time: '11:58',
        isMine: false,
      },
      {
        id: '3',
        content:
          'Хассельблад, много адаптируя SWC для космоса, но что-то пошло не так в расчетах или инженерии и не пошло. Всего их было произведено 25 штук, одну из них недавно продали за 450000 евро.',
        time: '11:58',
        isMine: false,
      },
      {
        id: '3',
        content:
          'Хассельблад, много адаптируя SWC для космоса, но что-то пошло не так в расчетах или инженерии и не пошло. Всего их было произведено 25 штук, одну из них недавно продали за 450000 евро.',
        time: '11:58',
        isMine: false,
      },
      {
        id: '4',
        content: 'Круто!',
        time: '12:00',
        isMine: true,
      },
    ],
  },
  {
    id: '5',
    title: 'тет-а-теты',
    message: 'Human Interface Guidelines и Material Design рекомендуют...',
    time: 'Ср',
    active: false,
    messages: [],
  },
  {
    id: '6',
    title: '1, 2, 3',
    message: 'Миллионы россиян ежедневно проводят десятки часов...',
    time: 'Пн',
    active: false,
    messages: [],
  },
];
